#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/private-henrique-percu/ecs-service-deploy/runs/run-yKBUUvmE1ozFATm1

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.aws_iam_role.ecs_task_execution_role: Refreshing...
data.aws_ecs_cluster.ecs_cluster: Refreshing...
data.aws_region.current: Refreshing...
data.aws_caller_identity.current: Refreshing...
data.aws_region.current: Refresh complete after 0s [id=us-west-2]
data.aws_caller_identity.current: Refresh complete after 0s [id=689210545704]
data.aws_iam_role.ecs_task_execution_role: Refresh complete after 0s [id=ecsTaskExecutionRole]
aws_ecs_task_definition.demo_container_application_task_definition: Refreshing state... [id=demo_container_application_family]
data.aws_ecs_cluster.ecs_cluster: Refresh complete after 0s [id=arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster]
aws_ecs_task_definition.demo_container_application_task_definition: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "demo_containerized_app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-west-2:689210545704:task-definition/demo_container_application_family:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + subnets          = [
              + "subnet-029716d74513844c3",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @HenriquePercu, Action: `pull_request`*